# Dog DNA

In [1]:
from datetime import datetime
start_time = datetime.now()

In [2]:
import pandas as pd

In [3]:
FILE_RAW = 'dog_dna.csv'

In [4]:
df = pd.read_csv(FILE_RAW)

In [5]:
df.head()

,Dog 1,chr0_0,Dog 1 A,Dog 1 G,Dog 2,chr0_0_1,Dog 2 A,Dog 2 G
0,0,chrUn_AAEX03020568_418,A,A,0,chrUn_AAEX03020568_418,A,A
1,0,chrUn_JH373319_445,A,A,0,chrUn_JH373319_445,A,A
2,0,chrUn_JH373268_626,G,G,0,chrUn_JH373268_626,G,G
3,0,chrUn_JH373321_790,A,A,0,chrUn_JH373321_790,A,A
4,0,chrUn_JH373278_1142,G,A,0,chrUn_JH373278_1142,G,G

In [6]:
pd.crosstab(df['Dog 1 A'], df['Dog 1 G'])

Dog 1 G    0      A      C    D      G    I     T
Dog 1 A
0        607      0      0    0      0    0     0
A          0  73718   2938    0  12541    0   613
C          0   3256  19821    0    597    0     0
D          0      0      0  307      0   63     0
G          0  16611    647    0  78877    0     0
I          0      0      0   88      0  433     0
T          0    667      0    0      0    0  3222

In [7]:
pd.crosstab(df['Dog 1 A'], df['Dog 1 G'], margins=True, margins_name='Total', dropna=True)

Dog 1 G    0      A      C    D      G    I     T   Total
Dog 1 A
0        607      0      0    0      0    0     0     607
A          0  73718   2938    0  12541    0   613   89810
C          0   3256  19821    0    597    0     0   23674
D          0      0      0  307      0   63     0     370
G          0  16611    647    0  78877    0     0   96135
I          0      0      0   88      0  433     0     521
T          0    667      0    0      0    0  3222    3889
Total    607  94252  23406  395  92015  496  3835  215006

In [8]:
end_time = datetime.now()
(end_time - start_time).total_seconds()

1.033929